{
  "title": "[CONCEPT] Pokémon Winds and Waves: 10e generatie pas in 2027 exclusief voor Nintendo Switch 2",
  "slug": "pokemon-winds-waves-10e-generatie-2027-nintendo-switch-2",
  "excerpt": "Pokémon Winds and Waves aangekondigd als 10e generatie. Release in 2027 exclusief voor Nintendo Switch 2. Alle details van het 30-jarig jubileum ev...",
  "content": "## Pokémon maakt grote surprise bekend op 30-jarig jubileum\n\nDe Pokémon Company heeft vandaag een gigantische bom laten vallen tijdens het 30-jarig jubileumfeest. **Pokémon Winds and Waves**, de langverwachte 10e generatie van de mainline games, is eindelijk officieel aangekondigd. Maar wacht even, want dit wordt nog interessanter.\n\nDe release staat gepland voor **2027** en dat is nog niet alles. Game Freak gaat flink riskanten nemen met deze titel, want Winds and Waves wordt een exclusieve titel voor de **Nintendo Switch 2**. Ja, je leest het goed. Dit zijn games die je niet op je huidige Switch kunt spelen.\n\n## Wat weten we tot nu toe?\n\nDe informatie is nog beperkt, maar wat we hebben gekregen is behoorlijk interessant. De thema's \"Winds\" en \"Waves\" suggereren dat Game Freak flink inspireert op lucht en water als centrale elementen. Dit opent natuurlijk allerlei speculaties onder de community. Zullen we een geheel nieuw gebied krijgen? Staat het in een bekend Pokémon-universum of ergens compleet nieuws?\n\nDe timing is ook geen toeval. Door de games exclusief naar de Switch 2 te brengen, geeft Nintendo een enorme boost aan de verkoop van hun nieuwe hardware. Eerlijkheidshalve een slimme zet, want wie kan nou nee zeggen tegen gloednieuwe Pokémon games?\n\n## Wat betekent dit voor gamers?\n\nVoor fans die momenteel genieten van Pokémon Scarlet en Violet duurt het nog behoorlijk lang wachten. Drie jaar is eigenlijk best lang in gamingjaren, vooral voor een franchise die normaal veel vaker nieuwe releases uitbrengt. **Maar goed**, dit geeft Game Freak de tijd om echt iets groots neer te zetten.\n\nDe Switch 2 exclusiviteit betekent ook dat we waarschijnlijk veel meer kunnen verwachten op grafisch vlak. De huidige Switch hardware is inmiddels behoorlijk oud, dus het zal interessant zijn om te zien wat Game Freak kan doen met meer power.\n\n## De community reageert\n\nSociale media staat momenteel op zijn kop. De ene helft van de pokéfans is dolenthousiast, terwijl de ander zich afvraagt of ze helemaal gek zijn geworden bij Game Freak. Een drie jaar durende wachttijd is best pittig, zeker nu we gewend zijn geraakt aan regelmatige Pokémon releases.\n\nEn ja, Switch-bezitters die nog niet over gaan upgraden naar de Switch 2 voelen zich misschien wel even genaaid. Maar als je echt hardcore in Pokémon zit, zul je uiteindelijk toch moeten bijdragen.\n\n## Kijken naar de toekomst\n\nDit is een interessant moment voor Nintendo en Game Freak. Ze gooien het roer flink om door een AAA-franchise exclusief aan de Switch 2 te binden. Of dit een schot voor de boeg is voor andere grote games op nieuwe hardware, dat zullen we wel zien.\n\nVoor nu kunnen we gaan speculeren, wishlistjes maken en hopen dat we snel meer informatie krijgen. **Pokémon Winds and Waves ziet er sowieso als een must-have uit**, en die 2027-release datum staat al in onze agenda's.",
  "category": "nieuws",
  "keywords": [
    "Pokémon Winds and Waves",
    "Nintendo Switch 2",
    "10e generatie",
    "2027 release",
    "Game Freak"
  ],
  "readTime": 4,
  "sourceUrl": "https://www.eurogamer.net/pokemons-10th-generation-winds-and-waves-will-not-release-until-2027-and-is-exclusive-to-the-nintendo-switch-2",
  "sourceName": "Eurogamer.net Latest Articles Feed"
}