{
  "title": "[CONCEPT] Marathon Server Slam breekt records met 143.000 spelers op Steam 2026",
  "slug": "marathon-server-slam-steam-records-143000-spelers",
  "excerpt": "Marathon's Server Slam explodeert op Steam met bijna 150.000 concurrent players op dag één. Dit is pas het begin van wat belooft een mega-launch te...",
  "content": "## Marathon Server Slam gaat viral op Steam\n\nZo, dit is indrukwekkend. Marathon's Server Slam is gisteren live gegaan en heeft Steam direct flink op zijn grondvesten doen schudden. We praten hier over **143.621 concurrent players** op de PC-versie alleen in de eerste 24 uur. Dat is geen klein bier voor een nieuwe titel, zeker niet als je weet dat console-spelers hier niet eens in meegerekend zijn.\n\nVoor wie nog niet helemaal bijgebeend is: de Server Slam is in feite een grote stress-test voor de servers van Marathon. Maar eerlijk gezegd voelt het meer als een gigantische launch-party waarbij iedereen tegelijk binnen wil stormen. De devs hebben hier duidelijk voorzien dat het zou vollopen, maar dat maakt de aantallen niet minder indrukwekkend.\n\n## Wat maakt Marathon zo interessant?\n\nDit is niet zomaar een random spel dat ineens viral gaat. Marathon heeft hype opgebouwd en dat betaalt zich nu uit. **De interesse is real**, en dat kun je zien aan die concurrent player-aantallen. Dit soort getallen zien we normaliter alleen bij behoorlijk grote releases of bij spellen die al jaren aan het groeien zijn.\n\nHet feit dat console-spelers nog niet eens meegeteld zijn in deze cijfers, maakt het nog wilder. Stel je voor wat de totale aantallen zouden zijn als je PlayStation, Xbox en Switch ook meeneemt. We zouden makkelijk naar 200.000+ spelers kunnen gaan.\n\n## De Server Slam werkt\n\nDit is eigenlijk precies waarom je een Server Slam doet, toch? Je wilt je netwerk testen onder extreme belasting voordat je het officieel uit de deur doet. **143.000 gelijktijdige spelers is geen grap** en dat zet het systeem echt aan het werk.\n\nOf de servers alles goed hebben verwerkt? Dat zullen we de komende dagen goed moeten volgen. Maar het feit dat ze überhaupt 143.000 spelers hebben kunnen hosten zonder dat alles in vlammen opging, geeft wel vertrouwen.\n\n## Wat nu?\n\nDe vraag is natuurlijk: hoe gaat dit zich ontwikkelen? Worden dit soort aantallen de norm, of was dit een eenmalige piek? Steam-getallen kunnen erg volatiel zijn, vooral bij nieuwe spellen. Maar één ding is zeker: Marathon heeft nu de volle aandacht van de gaming-community.\n\nEcht interessant om te zien hoe dit verder gaat. Dit kan het begin zijn van iets groots. **Volg je Marathon al?** Het ziet er in ieder geval naar uit dat je niet alleen bent als je het gaat proberen.",
  "category": "nieuws",
  "keywords": [
    "Marathon",
    "Server Slam",
    "Steam",
    "143000 spelers",
    "concurrent players"
  ],
  "readTime": 4,
  "sourceUrl": "https://www.eurogamer.net/marathon-server-slam-steam-players-concurrent",
  "sourceName": "Eurogamer.net Latest Articles Feed"
}