{
  "title": "[CONCEPT] Pokémon Wind and Waves aangekondigd: 10e generatie komt pas in 2027 naar Switch 2",
  "slug": "pokemon-wind-and-waves-2027-switch-2-exclusief",
  "excerpt": "Pokémon's 10e generatie Wind and Waves is officieel onthuld. De games verschijnen in 2027 en zijn exclusief voor de Nintendo Switch 2.",
  "content": "## Pokémon Wind and Waves officieel aangekondigd\n\nNintendo heeft zojuist een **gigantische bommetje** gegooid tijdens de 30-jarige jubileumviering van Pokémon. De 10e generatie mainline games, getiteld **Pokémon Wind and Waves**, zijn eindelijk onthuld. Alleen jammer: we moeten nog flink wachten voordat we deze dikke titel in handen hebben.\n\nDe release is namelijk gepland voor **2027**, en dan nog exclusief op de aankomende Nintendo Switch 2. Dat betekent dat Pokémon-fans met een oude Switch of ander platform voorlopig afhankelijk zijn van de huidige 9e generatie of moeten upgraden naar de volgende generatie console.\n\n\n## Wat weten we tot nu toe?\n\nOver de daadwerkelijke content van Wind and Waves is nog niet zoveel losgelaten, maar de namen alleen al zeggen genoeg. Het thema draait duidelijk om wind en water, wat suggereert dat de nieuwe regio's en Pokémon zich waarschijnlijk rond watergebieden en luchtgebeuren gaan afspelen. Dit is klassieke Pokémon-manier om spelers al hype op te bouwen met alleen maar een titel.\n\nHet feit dat Game Freak ervoor kiest om deze generatie **exclusief** voor de Switch 2 uit te brengen, is best interessant. Dit geeft Nintendo echt een reden voor gamers om over te stappen naar de nieuwe hardware. Voorafgaande generaties waren meestal ook beschikbaar op oudere consoles, dus dit is een duidelijke strategische zet.\n\n\n## De lange wachttijd\n\nZeven jaar wachten op een nieuwe Pokémon-generatie is best pittig. Ter vergelijking: de afstand tussen andere generaties is meestal twee tot vier jaar. Dit geeft Game Freak echter veel tijd om echt iets speciaals neer te zetten voor de Switch 2's superieure hardware. We mogen dus hopen op **ongeziene graphics, nieuwe mechanics en een enorm aantal nieuwe Pokémon**.\n\nDe gok van Nintendo en Game Freak is duidelijk: zij zeggen eigenlijk dat Pokémon zo'n big deal is dat het waard is om jaren mee te wachten. Of dat uitkomt, hangt natuurlijk af van hoe goed de Switch 2 zelf wordt ontvangen.\n\n\n## Wat intussen?\n\nFor nu blijven huidige Pokémon-spelers bezig met de 9e generatie. Er zullen ongetwijfeld nog updates, spinoffs en andere Pokémon-gerelateerde releases verschijnen voordat Wind and Waves arriveert. Nintendo is slim genoeg om geen gat van zeven jaar vol niks te laten.\n\nDit is dus grote news voor de Pokémon-fandom, al moet je wel geduld hebben. De hype gaat pas echt groeien als we dichterbij 2027 komen en meer details naar buiten komen. Tot die tijd: houden die Poké Balls maar even warm!",
  "category": "nieuws",
  "keywords": [
    "Pokémon Wind and Waves",
    "Nintendo Switch 2",
    "10e generatie Pokémon",
    "2027 release",
    "Game Freak"
  ],
  "readTime": 4,
  "sourceUrl": "https://www.eurogamer.net/pokemons-10th-generation-winds-and-waves-will-not-release-until-2027-and-is-exclusive-to-the-nintendo-switch-2",
  "sourceName": "Eurogamer.net Latest Articles Feed"
}