{
  "title": "[CONCEPT] Towerborne 1.0 Release: Stoic Games over Solo-aanpassingen en Combat-verbeteringen 2026",
  "slug": "towerborne-1-0-release-stoic-games-interview-solo-combat",
  "excerpt": "Stoic Games spreekt over de lange weg naar Towerborne 1.0. Lees over hun fokus op solo-spelers en grote combat-veranderingen.",
  "content": "Towerborne staat eindelijk op het punt om volledig uit early access te gaan. Stoic Games gaf onlangs een interview waarin ontwerpers diepgang gaven over de langdurige ontwikkelingsfase en de keuzes die ze hebben gemaakt voor de officiële 1.0 release.\n\n## Early Access Wat Langer dan Verwacht\n\nDe weg naar launch bleek aanzienlijk voller te zitten dan aanvankelijk gepland. Design director en lead combat designer van Stoic Games leggen uit dat ze veel geleerd hebben van de community feedback en dat dit gevolgen had voor hun roadmap. De extra tijd in early access was nodig om echt naar de spelers te luisteren en grote wijzigingen door te voeren.\n\n**Ze willen het spel gewoon goed afleveren**, en dat kost wat meer tijd dan gedacht. Maar hey, beter laat en goed dan snel en ondermaats, toch?\n\n\n## Solo-spelers Krijgen Eindelijk De Liefde\n\nEen van de grote veranderingen betreft de ondersteuning voor solo-gamers. Lange tijd voelde Towerborne als een game die vooral ontworpen was voor multiplayer groepen, maar de makers realiseerden zich dat niet iedereen wil samenspelen. Daarom hebben ze flinke aanpassingen gedaan.\n\nDe single-player experience is nu veel beter gebalanceerd. Monsters, missies en rewards zijn aangepast zodat solo-adventurers niet achteraf zijn. Dit is een belangrijk signaal naar de community dat Stoic Games iedereen wil bereiken, niet alleen de squad-gamers.\n\n\n## Combat-systeem Krijgt Serieuze Upgrade\n\nHet combatsysteem onderging meerdere iteraties. De lead combat designer vertelde dat ze gemerkt hadden dat bepaalde mechanics niet goed werkten in praktijk, ook al zagen ze er op papier goed uit. Ze hebben daarom verschillende core features aangepast.\n\n**Het gevoel van vechten moet beter voelen**, meer impactful en responsief. Ze willen dat elke hit voelt als iets wat ergens om gaat. De feedback-loop tussen aanvallen, dodgen en tegenaanvallen is herwerkt zodat de gameplay sneller en satisfyinger wordt.\n\n\n## Wat Nog Meer Veranderde?\n\nNaast solo-ondersteuning en combat-verbeteringen zijn er nog veel kleinere en grotere aanpassingen gedaan. Quality of life features werden toegevoegd, balancing-issues werden aangepakt, en de grind is wat vriendelijker gemaakt. Stoic Games heeft echt geluisterd naar wat de community wilde zien.\n\nDe directeur benadrukte ook dat de launch van 1.0 niet het einde van de ontwikkeling is. Ze hebben plannen voor post-launch support en willen het spel blijven verbeteren op basis van feedback.\n\n\n## Wanneer Gaat Deze Vent Live?\n\nEcht concrete datums werden niet genoemd in het interview, maar het is duidelijk dat Stoic Games eindelijk aan het finishen is. De 1.0 release staat op het lijstje voor dit jaar, en het ziet er naar uit dat we niet veel langer hoeven wachten.\n\nTowerborne ontwikkelt zich langzaam maar zeker tot een solide actie-RPG die zowel solo als co-op goed speelt. Wie een beetje gek is op hack-and-slash gameplay en mooie pixel art, moet dit zeker in het vizier houden. Dit wordt wat ons betreft echt een aanrader als het uit early access komt.",
  "category": "nieuws",
  "keywords": [
    "Towerborne",
    "Stoic Games",
    "early access",
    "1.0 release",
    "solo-spelers"
  ],
  "readTime": 4,
  "sourceUrl": "https://store.steampowered.com/news/group/6070552/view/496095786926342890",
  "sourceName": " RSS Feed"
}