{
  "title": "[CONCEPT] Towerborne 1.0 Release: Stoic Games Praat over Solo Spelers en Combat Verbeteringen",
  "slug": "towerborne-1-0-release-stoic-games-interview-2026",
  "excerpt": "Stoic Games onthult wat Towerborne heeft veranderd sinds early access en hoe ze solo spelers beter gaan ondersteunen in de 1.0 release.",
  "content": "## Towerborne gaat definitief uit early access\n\nNa een lange time in early access gaat Towerborne eindelijk van een volle 1.0 release krijgen. Stoic Games heeft een diepgaand interview gegeven waarin ze vertellen hoe het lange traject van de game eruitzag en welke belangrijke veranderingen ze hebben doorgevoerd. Volgens de design director en lead combat designer hebben ze veel geleerd van de community feedback.\n\nDe weg naar 1.0 was behoorlijk lang en met behoorlijk wat hobbels. Het team heeft constant aan de gameplay gewerkt en feedback verwerkt. Dit heeft geleid tot enkele drastische veranderingen die de game veel beter hebben gemaakt. Waar het volgens Stoic Games echt om gaat, is dat ze de juiste balans hebben gevonden tussen wat de community wilde en wat voor de game goed was.\n\n\n## Solo spelers krijgen eindelijk liefde\n\nEen van de grootste veranderingen waar Stoic Games op focus legt, is de ondersteuning voor solo spelers. In het verleden voelde Towerborne namelijk meer gericht op co-op en multiplayer ervaringen. Dat is nu echt anders geworden.\n\nDe developers hebben speciale aandacht gegeven aan solo gameplay mechanics. Dit betekent dat je niet meer het gevoel hebt dat je achterop raakt als je liever in je eentje speelt. **De solo experience is nu gelijkwaardig aan de co-op variant**, wat echt een breaker kan zijn voor veel gamers. Het maakt de game veel toegankelijker voor iedereen.\n\n\n## Combat systeem volledig onder handen genomen\n\nNaast de solo focus hebben ze ook gigantisch veel tijd besteed aan het verbeterde combat systeem. De lead combat designer noemt dit een van de meest cruciale updates. Het gevecht voelde voorheen niet helemaal soepel, en dat is nu echt opgelost.\n\nDe developers hebben de feedback van spelers serieus genomen en hebben geluisterd naar wat niet goed werkte. Ze hebben timings aangepast, animations verbeterd en het hele systeem voelt veel beter. Combattanten zullen merken dat aanvallen sneller voelen, dat parrying bevredigender is en dat je veel meer controle hebt over je karakters.\n\n\n## Wat nog meer is veranderd\n\nHet interview geeft ook inzicht in nog meer verbeteringen die voor 1.0 zijn doorgevoerd. **De progression systemen zijn aangepast**, de loot mechanics zijn beter geworden en de overall balancing is veel sterker. Het klinkt erop dat Stoic Games echt geen stenen heeft onwillekeurig gelaten.\n\nWat opvalt is dat het team open is geweest over fouten die ze hebben gemaakt. Ze geven eerlijk toe waar het mis liep in early access en hoe ze dat hebben opgelost. Dat geeft vertrouwen dat de 1.0 release echt een solide spelervaring gaat worden.\n\n\n## Klaar voor de launch\n\nMet al deze veranderingen en verbeteringen lijkt Towerborne eindelijk klaar voor de definitieve launch. Het is duidelijk dat Stoic Games veel geduld heeft gehad met het ontwikkelingstraject en niet voortijdig uit early access is gegaan. Dat respect voor kwaliteit mogen we eigenlijk alleen maar toejuichen.\n\nGamers die al op Towerborne wachten kunnen binnenkort hun handen eraan gaan branden. En voor zij die hesitant waren vanwege de early access phase? Dit is misschien eindelijk het moment om het een kans te geven.",
  "category": "nieuws",
  "keywords": [
    "Towerborne",
    "1.0 release",
    "Stoic Games",
    "solo gameplay",
    "combat systeem"
  ],
  "readTime": 4,
  "sourceUrl": "https://store.steampowered.com/news/group/6070552/view/496095786926342890",
  "sourceName": " RSS Feed"
}